КоманднаяРабота/src/Documents/ДЗ_Доставка/ДЗ_Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДЗ_Доставка</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КоманднаяРабота/src/Documents/ДЗ_Доставка/ManagerModule.bsl
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;    
	
КонецПроцедуры    

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Анкета клиента QR
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АнкетаКлиента QR";
	КомандаПечати.Представление = НСтр("ru = 'Анкета клиента QR-код'");
	КомандаПечати.Порядок = 5;   
	
	// Товарная накладная QR
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТоварнаяНакладнаяQR";
	КомандаПечати.Представление = НСтр("ru = 'Товарная накладная QR-код'");
	КомандаПечати.Порядок = 10;   
	
	// Комплект
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АнкетаКлиента QR,ТоварнаяНакладнаяQR";
	КомандаПечати.Представление = НСтр("ru = 'Комплект документов'");
	КомандаПечати.Порядок = 15;
	
	// Договор на поставку
	КомандаПечати = КомандыПечати.Добавить(); 
	КомандаПечати.МенеджерПечати = "УправлениеПечатью";
	КомандаПечати.Идентификатор = "Документ.ДЗ_Доставка.ПФ_DOC_ДоговорНаПоставку";
	КомандаПечати.Представление = НСтр("ru = 'Договор на поставку (DOC)'");
	КомандаПечати.Порядок = 20;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АнкетаКлиента");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьАнкетыКлиента(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Анкета клиента'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ДЗ_Доставка.ПФ_MXL_АнкетаКлиента";
	КонецЕсли;   
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АнкетаКлиента QR");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьАнкетыКлиентаQR(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Анкета клиента'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ДЗ_Доставка.ПФ_MXL_АнкетаКлиента";
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ТоварнаяНакладная");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьТоварнойНакладной(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Товарная накладная'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ДЗ_Доставка.ПФ_MXL_ТоварнаяНакладная";
	КонецЕсли; 
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ТоварнаяНакладнаяQR");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьТоварнойНакладнойQR(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Товарная накладная'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ДЗ_Доставка.ПФ_MXL_ТоварнаяНакладная";
	КонецЕсли;

	
КонецПроцедуры

Функция ПечатьАнкетыКлиента(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыАнкетыКлиента";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ДЗ_Доставка.ПФ_MXL_АнкетаКлиента");
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВывестиЗаголовокАнкетыКлиента(ДанныеДокументов, ТабличныйДокумент, Макет); 
		ВывестиТаблицуАнкетыКлиента(ДанныеДокументов, ТабличныйДокумент, Макет); 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,НомерСтрокиНачало,
		ОбъектыПечати, ДанныеДокументов.Ссылка);
		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции    

Функция ПечатьАнкетыКлиентаQR(МассивОбъектов, ОбъектыПечати)	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыАнкетыКлиента";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ДЗ_Доставка.ПФ_MXL_АнкетаКлиента");
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВывестиЗаголовокАнкетыКлиентаQR(ДанныеДокументов, ТабличныйДокумент, Макет); 
		ВывестиТаблицуАнкетыКлиента(ДанныеДокументов, ТабличныйДокумент, Макет); 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,НомерСтрокиНачало,
		ОбъектыПечати, ДанныеДокументов.Ссылка);
		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьДанныеДокументов(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДЗ_Доставка.Ссылка КАК Ссылка,
	               |	ДЗ_Доставка.Номер КАК Номер,
	               |	ДЗ_Доставка.Дата КАК Дата,
	               |	ДЗ_Доставка.Организация КАК Организация,
	               |	ДЗ_Доставка.Контрагент КАК Контрагент,
	               |	ДЗ_Доставка.Договор КАК Договор,
	               |	ДЗ_Доставка.Ответственный КАК Ответственный,
	               |	ДЗ_Доставка.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество
	               |	) КАК Товары
	               |ИЗ
	               |	Документ.ДЗ_Доставка КАК ДЗ_Доставка
	               |ГДЕ
	               |	ДЗ_Доставка.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ВывестиЗаголовокАнкетыКлиента(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьЗаголовокАнкеты = Макет.ПолучитьОбласть("Заголовок");
	
	ДанныеПечати = Новый Структура;
	
	ШаблонЗаголовка = "Анкета клиента %1 от %2";
	ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка,
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
		Формат(ДанныеДокументов.Дата, "ДЛФ=DD"));
	ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	
	ОбластьЗаголовокАнкеты.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьЗаголовокАнкеты);
	
КонецПроцедуры 

Процедура ВывестиТаблицуАнкетыКлиента(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьТаблицыДокумента = Макет.ПолучитьОбласть("ТаблицаАнкеты");
	
	ДанныеПечати = Новый Структура;
	
	ОбластьТаблицыДокумента.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьТаблицыДокумента);
	
КонецПроцедуры

Процедура ВывестиЗаголовокТоварнойНакладной(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьЗаголовокТН = Макет.ПолучитьОбласть("Заголовок");
	
	ДанныеПечати = Новый Структура;
	
	ШаблонЗаголовка = "Товарная накладная %1 от %2";
	ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка,
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
		Формат(ДанныеДокументов.Дата, "ДЛФ=DD"));
	ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	
	ОбластьЗаголовокТН.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьЗаголовокТН);
	
КонецПроцедуры 

Функция ПечатьТоварнойНакладной(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыТоварнойНакладной";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ДЗ_Доставка.ПФ_MXL_ТоварнаяНакладная");
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВывестиЗаголовокТоварнойНакладной(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		ВывестиОтправительПолучатель(ДанныеДокументов, ТабличныйДокумент, Макет);      
		
		ВывестиТаблицаШапка(ДанныеДокументов, ТабличныйДокумент, Макет);         
			
		ВывестиПодвалТоварнойНакладной(ДанныеДокументов, ТабличныйДокумент, Макет);    
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);		
		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьТоварнойНакладнойQR(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыТоварнойНакладной";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ДЗ_Доставка.ПФ_MXL_ТоварнаяНакладная");
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВывестиЗаголовокТоварнойНакладнойQR(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		ВывестиОтправительПолучатель(ДанныеДокументов, ТабличныйДокумент, Макет);      
		
		ВывестиТаблицаШапка(ДанныеДокументов, ТабличныйДокумент, Макет);         
			
		ВывестиПодвалТоварнойНакладной(ДанныеДокументов, ТабличныйДокумент, Макет);    
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);		
		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Процедура ВывестиЗаголовокТоварнойНакладнойQR(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	Перем ГенерацияШтрихкода;
	ОбластьЗаголовокQRТН = Макет.ПолучитьОбласть("ЗаголовокQR");
	
	ДанныеПечати = Новый Структура;
	
	ШаблонЗаголовка = "Товарная накладная %1 от %2";
	ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка,
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
		Формат(ДанныеДокументов.Дата, "ДЛФ=DD"));
	ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка); 
	
		//QR-код
	СтрокаСсылки = ПолучитьНавигационнуюСсылку(ДанныеДокументов.Ссылка);
	
	ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(СтрокаСсылки, 1, 120); 
	КартинкаQRКода = Новый Картинка(ДанныеQRКода);  
	ОбластьЗаголовокQRТН.Рисунки.QRКод.Картинка = КартинкаQRКода;
	
	ОбластьЗаголовокQRТН.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьЗаголовокQRТН);
	
КонецПроцедуры 

Процедура ВывестиОтправительПолучатель(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьОтправительПолучатель = Макет.ПолучитьОбласть("ОтправительПолучатель");
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Грузополучатель", ДанныеДокументов.Организация);
	ДанныеПечати.Вставить("Грузоотправитель", ДанныеДокументов.Контрагент);
	
	ОбластьОтправительПолучатель.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьОтправительПолучатель);  
	
КонецПроцедуры

Процедура ВывестиТаблицаШапка(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ТаблицаШапка"); 
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("ТаблицаСтроки");

	
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаТовары = ДанныеДокументов.Товары.Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаТовары);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла;

КонецПроцедуры

Процедура ВывестиПодвалТоварнойНакладной(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьПодвалаТН = Макет.ПолучитьОбласть("ПодвалТН");
	
	ДанныеПечати = Новый Структура;
	
	ОбластьПодвалаТН.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьПодвалаТН);
	
КонецПроцедуры 

Процедура ВывестиЗаголовокАнкетыКлиентаQR(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	Перем ГенерацияШтрихкода;
	ОбластьЗаголовокQR = Макет.ПолучитьОбласть("ЗаголовокQR");
	
	ДанныеПечати = Новый Структура;
	
	ШаблонЗаголовка = "Анкета клиента %1 от %2";
	ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка,
	ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
	Формат(ДанныеДокументов.Дата, "ДЛФ=DD"));
	ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	
	ОбластьЗаголовокQR.Параметры.Заполнить(ДанныеПечати); 
	
	//QR-код
	СтрокаСсылки = ПолучитьНавигационнуюСсылку(ДанныеДокументов.Ссылка);
	
	ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(СтрокаСсылки, 1, 120); 
	КартинкаQRКода = Новый Картинка(ДанныеQRКода);  
	ОбластьЗаголовокQR.Рисунки.QRКод.Картинка = КартинкаQRКода; 
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовокQR);
	
КонецПроцедуры
